import pandas as pd

df_report = pd.read_csv('data/report.csv',header=0,names=[
            "ID","資料年度","資料月份","酪農場代號","乳牛編號",
            "父親牛精液編號","母親乳牛編號","出生日期","胎次","泌乳天數",
            "乳量","最近分娩日期","採樣日期","月齡","檢測日期",
            "最後配種日期","最後配種精液","配種次數","前次分娩日期","第一次配種日期","第一次配種精液"])
df_birth = pd.read_csv('data/birth.csv',header=0,names=[
            "乳牛編號","分娩日期","乾乳日期","犢牛編號1","讀牛編號2",
            "母牛體重","登錄日期","計算胎次","胎次","分娩難易度",
            "犢牛體型","犢牛性別","酪農場代號"])
df_breed = pd.read_csv('data/breed.csv',header=0,names=[
            "乳牛編號","配種日期","配種精液","登錄日期","孕檢",
            "配種方式","精液種類","酪農場代號"])
df_spec = pd.read_csv('data/spec.csv',header=0,names=[
            "乳牛編號","狀況類別","裝況代號","狀況日期","備註",
            "登錄日期","酪農場代號"])